Revit 2024 API
FabricSheet.CoverOffset Property
 The additional cover offset of the Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double CoverOffset { get; set; }
Visual Basic
Public Property CoverOffset As Double
	Get
	Set
Visual C++
public:
property double CoverOffset {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for coverOffset is not a number -or- When setting this property: coverOffset is greater then the host thickness.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for coverOffset must be between 0 and 30000 feet.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property:
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace